Ran Plan for project: `sharedservices-prod` dir: `accounts/backstage-prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-multiaccounts.tfvars with secrets from SSM.
Wrote /home/atlantis/.atlantis/nonprod-ue2-multiaccounts.tfvars with secrets from SSM.


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_cluster.main will be updated in-place
~ resource "aws_ecs_cluster" "main" {
        id       = "arn:aws:ecs:us-east-2:825765422855:cluster/backstage-cluster"
        name     = "backstage-cluster"
      ~ tags     = {
          - "Name" = "backstage-cluster" -> null
        }
      ~ tags_all = {
          - "Name"       = "backstage-cluster" -> null
            # (1 unchanged element hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # aws_ecs_service.backstage will be updated in-place
~ resource "aws_ecs_service" "backstage" {
        id                                 = "arn:aws:ecs:us-east-2:825765422855:service/backstage-cluster/backstage-service"
        name                               = "backstage-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-east-2:825765422855:task-definition/backstage-task:7" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.backstage must be replaced
-/+ resource "aws_ecs_task_definition" "backstage" {
      ~ arn                      = "arn:aws:ecs:us-east-2:825765422855:task-definition/backstage-task:7" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-2:825765422855:task-definition/backstage-task" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - essential        = true
                  ~ image            = "825765422855.dkr.ecr.us-east-2.amazonaws.com/backstage-repo@sha256:b8ade524e83c988008582be6deca07ff989bc96be4734e474cd9e97d316c581d" -> "825765422855.dkr.ecr.us-east-2.amazonaws.com/backstage-repo@sha256:b103533d8fa308e71619604f5b803431d62f70485195a5810e88347aebcc358d"
                  - mountPoints      = []
                    name             = "backstage"
                  ~ portMappings     = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                  - systemControls   = []
                  - volumesFrom      = []
                    # (2 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "backstage-task" -> (known after apply)
      ~ revision                 = 7 -> (known after apply)
      - tags                     = {} -> null
        # (12 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p sharedservices-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://18.217.82.45:4141/lock?id=ryan-longoria%252FFeedUtopia%252Faccounts%252Fbackstage-prod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p sharedservices-prod
  ```
Plan: 1 to add, 2 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```